app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
	def index
		@companies = Company.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@company = Company.find(params[:id])

INSERT INTO "companies" ("cnpj", "nome", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		@company = Company.new(user_params)
		if @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
  		@company = Company.find(params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]
---
    def destroy
  		@company = Company.find(params[:id])
  		@company.destroy