app/controllers/exames_controller.rb

SELECT "exames".* FROM "exames"
---
    def index
        @exames = Exame.all

INSERT INTO "exames" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Criando Avaliação"], ["created_at", "2016-05-11 02:54:08.040903"], ["updated_at", "2016-05-11 02:54:08.040903"]]
---
    def create
        @exame = Exame.new(exame_params)
        if @exame.save

SELECT  "exames".* FROM "exames" WHERE "exames"."id" = ? LIMIT 1  [["id", 0]]
---
    def show
        @exame = Exame.find(params[:id])