app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT 1  [["login", "dasda"]]
---
	def create
		@user = User.find_by(login: params[:session][:login])