app/controllers/sessions_companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."cnpj" = ? LIMIT 1  [["cnpj", ""]]
---
	def create
		@company = Company.find_by(cnpj: params[:session][:cnpj])