app/views/exames/index.html.erb

SELECT "exames".* FROM "exames"
---
					<tbody>
						<% current_company.exames.each do |exame| %>